app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.all
---
SELECT * FROM "pictures"

  def picture
    @picture = Picture.find(params[:id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 4)

  def show
    @picture = Picture.find(params[:id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 2)

  def add_caption
    new_caption_id = "new_caption_%d" % params[:picture_id]
    @current_caption = Caption.create(:headline => params[new_caption_id],
                                      :picture_id => params[:picture_id],
                                      :user_id => session[:user_id])
    @current_caption.save
    @picture = Picture.find(params[:picture_id])
---
INSERT INTO "captions" ("created_at", "updated_at", "headline", "user_id", "picture_id") VALUES('2009-12-30 05:01:05', '2009-12-30 05:01:05', 'Craziness is craziness does.', 7, 2)
SELECT * FROM "pictures" WHERE ("pictures"."id" = 2)

  def caption_vote
    @vote = Vote.get_vote_for_user_and_caption(session[:user_id], params[:id])
    @vote.is_up = params[:u]
    @vote.save
---
INSERT INTO "votes" ("caption_id", "created_at", "updated_at", "user_id", "is_up") VALUES(1, '2009-12-30 05:49:44', '2009-12-30 05:49:44', 1, 'y')

  def edit
    @picture = Picture.find(params[:id])
---
SELECT * FROM "pictures" WHERE ("pictures"."id" = 1)

  def create
    @picture = Picture.new(params[:picture])
    @picture.user_id = session[:user_id]

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("path_to_picture", "created_at", "picture_data", "content_type", "updated_at", "headline", "user_id") VALUES('rails.png', '2009-12-31 04:46:14', '‰PNG

  def set_session_user_id(new_id)
    x = User.find(new_id)
---
SELECT * FROM "users" WHERE ("users"."id" = 2)